In [19]:
import numpy as np
import pandas as pd
import openpyxl

In [20]:
pd.DataFrame([np.arange(0, 100, 10), np.arange(100, 200, 10)], index=['First', 'Second'], columns=list('ABCDEFGHIJ'))

          A    B    C    D    E    F    G    H    I    J
First     0   10   20   30   40   50   60   70   80   90
Second  100  110  120  130  140  150  160  170  180  190

In [42]:
grades = pd.DataFrame([
    ['Reshma', 'Rajesh', 'Rahul'],
    ['Ranjan', 'Raul', 'Rakesh']
], index=['I', 'II'], columns=['First', 'Second', 'Third'])

In [43]:
grades

     First  Second   Third
I   Reshma  Rajesh   Rahul
II  Ranjan    Raul  Rakesh

In [46]:
pd.DataFrame.to_csv(grades, 'dataframe.csv')
pd.DataFrame.to_excel(grades, 'dataframe.xlsx')

In [22]:
A = pd.Series([10, 20, 30], index=list('abc'))
B = pd.Series([30, 40, 50], index=list('dab'))
C = pd.Series([70, 80, 'a'], index=list('adf'))

In [23]:
pd.DataFrame([A, B, C]).fillna(0)

      a     b     c     d  f
0  10.0  20.0  30.0   0.0  0
1  40.0  50.0   0.0  30.0  0
2  70.0   0.0   0.0  80.0  a

In [24]:
pd.DataFrame({'A': A, 'B': B, 'C': C}).fillna(':(')

      A     B   C
a  10.0  40.0  70
b  20.0  50.0  :(
c  30.0    :(  :(
d    :(  30.0  80
f    :(    :(   a

In [25]:
marks = pd.DataFrame({
    'Physics': pd.Series([100, 60, 80], index=['Manish', 'Dilshan', 'Ajgar']),
    'Maths': pd.Series([0, 0, 1], index=['Manish', 'Dilshan', 'Ajgar']),
    'Computer': pd.Series([50, 50], index=['Dilshan', 'Ajgar'])
})

# marks = marks.fillna(0)

In [26]:
display(marks)

         Physics  Maths  Computer
Ajgar         80      1      50.0
Dilshan       60      0      50.0
Manish       100      0       NaN

In [27]:
marks.join(pd.DataFrame(columns=['Biology', 'Chemistry']))

         Physics  Maths  Computer Biology Chemistry
Ajgar         80      1      50.0     NaN       NaN
Dilshan       60      0      50.0     NaN       NaN
Manish       100      0       NaN     NaN       NaN

In [28]:
marks.iloc[0]

Physics     80.0
Maths        1.0
Computer    50.0
Name: Ajgar, dtype: float64

In [29]:
marks + pd.DataFrame(columns=['Chemistry', 'Biology'])

        Biology Chemistry  Computer  Maths  Physics
Ajgar       NaN       NaN       NaN    NaN      NaN
Dilshan     NaN       NaN       NaN    NaN      NaN
Manish      NaN       NaN       NaN    NaN      NaN

In [30]:
display(marks)

         Physics  Maths  Computer
Ajgar         80      1      50.0
Dilshan       60      0      50.0
Manish       100      0       NaN